
#include <iostream>




using namespace std;




int main (int argc, char * argv [], char * envp [])
{
	// Что вы хотите сделать? Создать новое дерево или загрузить имеющееся? Или выйти?

	/* 1. Создать новое:
	Задать название и начать редактирование
	В любой момент обрабатывать команды:
		- создать вход (с параметрами или без)
		- удалить вход (переназначить потомков, удалить потомков, создать новый вход для потомков)
		- задать входу параметры
		
		- создать преобразователь (с параметрами или без)
		- удалить преобразователь (переназначить потомков, удалить потомков, создать новый вход для потомков)
		- задать преобразователю параметры

		- создать нагрузку (с параметрами или без)
		- удалить нагрузку
		- задать нагрузке параметры

		- переподчинить преобразователь или нагрузку входу или преобразователю (поднять потомков на уровень по иерархии, перетащить вслед за родителем)

		- завершить редактирование
		- возобновить редактирование
		
		- рассчитать
		- показать результаты
		- рассчитать и показать результаты
	*/

	// 2. Загрузить или выйти

	return 0;
}
